espressif/idf-extra-components/pid_ctrl/host_test/sdkconfig.defaults
CONFIG_IDF_TARGET="linux"
CONFIG_PID_CTRL_IQ_FORMAT=24
